package baekjoon;

	/*
	x축 위에 원이 N개 있다. 원은 서로 교차하지 않는다. 하지만, 접할 수는 있다.
	
	원으로 만들어지는 영역이 몇 개인지 구하는 프로그램을 작성하시오.
	
	영역은 점의 집합으로 모든 두 점은 원을 교차하지 않는 연속되는 곡선으로 연결될 수 있어야 한다.
	
	
	
	입력
	첫째 줄에 원의 개수 N(1 ≤ N ≤ 300,000)이 주어진다.
	
	다음 N개 줄에는 각 원의 정보 xi와 ri가 주어진다. xi는 원의 중심 좌표이며, ri는 반지름이다. (-109 ≤ xi ≤ 109, 1 ≤ ri ≤ 109)
	
	입력으로 주어지는 원은 항상 유일하다.
	
	출력
	첫째 줄에 원으로 인해서 만들어지는 영역의 개수를 출력한다.
	
	예제 입력 1 
	4
	7 5
	-9 11
	11 9
	0 20
	예제 출력 1 
	6
	*/

public class Test10000 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
